//大小端介绍----以字节存储的形式(二进制)
//大端字节序存储：把一个数据的高位字节序的内容放在低地址处，把一个数据的低位字节序的内容放在高地址处
//小端字节序存储：把一个数据的高位字节序的内容放在高地址处，把一个数据的低位字节序的内容放在低地址处
//对于2个字节以上的数据（不论；；）

//#include<stdio.h>
//int main()
//{
//	int a = 1;
//	return *(char*)&a;
//}


#include<stdio.h>

//int main()
//{
//	char a = -1;
//	signed char b = -1;
//	unsigned char c= -1;//unsigned char的范围是0~255
//	printf("a=%d,b=%d,c=%d", a, b, c);//%d是打印有符号的整形
//	return 0;
//}
//11111111如果是补码，那么最前面的1是符号位，最后是-1
//11111111如果是无符号的，那么均为正数---255
//unsigned short---0~65535   

//int main()
//{
//	char a = -128;  //char -128~127
//	printf("%u\n", a);
//
//	return 0;
//}

//10000000000000000000000010000000
//11111111111111111111111101111111
//11111111111111111111111110000000--截断
//10000000  --a
//11111111111111111111111110000000--整型提升

//int main()
//{
//	unsigned int i;   //最开始断定>=0
//	for (i = 9;i >= 0;i--)
//	{
//		printf("%u\n", i);//9 8 7 6 5 4 3 2 1 -1
//		                  //-1  10000000000000000000000000000001
//		                  //    11111111111111111111111111111110
//		                  //    11111111111111111111111111111111    无符号数
//		Sleep(1000);  //休眠1000ms
//	}
//	return 0;
//}
#include<string.h>

//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0;i < 1000;i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d", strlen(a));
//	//strlen 是求字符串的长度，关注的是字符串中\0(数字0)之前出现多少字符
//
//	//arr[i]--->char  -128~127
//	//根本放不下-1000
//	//存储的时候就像一个圆圈
//	//-1 -2 -3...-128 127 126.....3 2 1 0 -1 ...
//	//                                  在这里遇见了0；就相当于遇到了\0,strlen停止计数，
//	// 最后0前面的数字的个数为128+127=255
//
//	return 0;
//}

//unsigned char i = 0;
//int main()
//{
//
//	for (i = 0;i < 255;i++)
//	{
//		printf("hello wrord\n");
//	}
//	return 0;
//	//死循环
//}

int main()
{
	int n = 9;
	float* pFloat = (float*)&n;

	printf("n的值为：%d\n", n);
	printf("*pFloat的值为:%d\n");
	*pFloat = 9.0;
	printf("num的值为：%d\n", n);
	printf("*pFloat的值为：%f\n", *pFloat);
	return 0;
}
//浮点数与整数的存储方式不同

//浮点数的存储规则