//C++核心课程

//1.内存分区模型
//代码区：存放函数的二进制代码，由操作系统进行管理
//全局区：存放全局变量和静态变量即常量
//栈区：由编译器自动分配释放，存放函数的参数值，局部变量等
//堆区：由程序员分配和存放，若程序员不释放，程序结束时由操作系统回收


//内存四区的意义
//不同区域存放的数据，赋予不同的生命周期，给我们更大灵活编程




//生成了exe可执行程序，未执行程序前分为两个区域（即代码区和全局区都是程序运行前就有的）


//代码区：存放CPU执行的机器指令
//        代码区是共享的，共享的目的是对于频繁被执行的程序，只需要在内存中有一份代码即可
//        代码区是只读的，使其只读的原因是防止程序意外地修改了他的指令

//全局区：存放全局变量和静态变量及常量---改区域的数据在程序结束后由操作系统释放



//在全局区的：全局变量  静态变量  static关键字  常量  字符串常量 const修饰的全局变量（全局常量）
//不在全局区的：局部变量，const修饰的局部变量（局部常量）



//程序运行后：栈区

//栈区：由编译器自动分配释放，存放函数的参数值，局部变量 等
//      注意事项：不要返回局部变量的地址，栈区开放的数据由编译器自动释放


#include<iostream>
using namespace std;

//int* func()
//{
//	int a = 10;//局部变量，存放在栈区，战区的数据在函数执行后自动释放
//   return &a;
//}

//int main()
//{
//	int* p = func();
//	cout << *p << endl;
//	cout << *p << endl;    //x86打印出来第二次是乱码，但是x64三次打印出来都是10
//	cout << *p << endl;
//
//
//
//	return 0;
//}



//堆区：由程序员分配和存放，若程序员不释放，程序结束时由操作系统回收
//在C++中主要用new在堆区开辟内存



int* func()
{
	//利用NEW关键字可以将数据开辟到堆区
	//指针  本质上也是局部变量，放在栈上，指针保存的数据是放在堆区
	int*p=new int(10);    //用new关键字

	return p;
}
int main()
{
	
	int* p = func();
	cout << *p << endl;
	cout << *p << endl;
	cout << *p << endl;
	cout << *p << endl;   //不把堆区的内存



	return 0;
}