//数组名到底是什莫
//数组名确实能表示首元素的地址，但是有两个例外
//1.sizeof（数组名），这里的朱祖明表示整个数组，计算的是整个数组的大小，单位是字节
//2.&数组名，这里的数组名也表示整个数组，取得是整个数组的地址
//除此自外，其他都是首元素的地址


//#include<stdio.h>
//int main()
//{
//	int arr[10];
//	printf("%p\n", arr);//%p是地址
//	printf("%p\n", &arr[0]);//上述的两个结果是一样的,印证了数组名确实是首元素的地址这一说法
//	printf("%p\n", &arr);//结果竟然也与上面一样
//
//	int n = sizeof(arr);
//	printf("%d", n);//但是这里打印的确实是40，而不是4
//	//这就与上述结论相悖
//
//	return 0;
//}

//#include<stdio.h>
//int main()
//{
//	int arr[10];
//	printf("%p\n", arr);//arr就是首元素的地址没错
//	printf("%p\n", arr+1);
//	printf("\n");
//	//运行结果为0000002F1C6FF6E8
//	//          0000002F1C6FF6EC   //差了四个字节
//	printf("%p\n", &arr[0]);//&arr[0]绝对无敌正确是首元素的地址
//	printf("%p\n", &arr[0]+1);
//	printf("\n");
//	//运行结果为0000002F1C6FF6E8
//	//          0000002F1C6FF6EC   //差了四个字节
//	printf("%p\n", &arr);//是整个数组的地址
//	printf("%p\n", &arr+1);
//	//运行结果为0000002F1C6FF6E8
//	//          0000002F1C6FF710   //涨了0x28---即40字节---因为一个数组的字节就是40字节
//
//	//这样直观能看出来数组的地址和首元素的地址之间的区别
//	return 0;
//}



//那么接受数组实参的形参就可以写成指针的形式，即写成int*arr

//二维数组的数组名
#include<stdio.h>
int main()
{
	int arr[3][4];
	int sz = sizeof(arr);
	printf("%d\n", sz);//48
	arr;//二维数组的数组名表示也首元素的地址，但是表示的是谁哪？
	//可以把二维数组想象成一维数组的数组，即一行数组元素，这一行行的元素又组成了一个数组
	//那么二维数组的数组名表示的是第一行的地址
	//虽然第一行的地址和 第一行第一个元素的地址看似一样，实际上表示的意义不同
	//即参照上面的方法，在arr后面加1，跳过的实际上是一行的地址
	return 0;
}

//想知道数组几行几列
//sizeof(arr)/sizeof(arr[0])---计算行数
//sizeof(arr[0]/sizeof[0][0])----计算列数