//调试

//Debug和Release版本的qubie
//Debug版本是指调试版本，它包括调试信息，并不做任何优化，便于程序员调试程序
//Release版本是发布版本，他往往是进行了各种优化，使得程序在代码大小和运行速度上都是最优的，一边用户更好的使用
//release版本不能单步调试

//学会快捷键
//F5     启动调试，经常用来跳到下一个断点（逻辑上的下一个断点）
//F9     创建断点和取消断点，断点的重要作用，可以在程序的任意位置停止执行，继而一步步执行下去

//断点舍不得删掉---禁用断点
//怀疑是第五次循环出现了问题---断点（条件）


//F5和F9相互配合着用，在想要停下来的地方停下（即程序刷一下的运行到断点处，后面的代码就可以一步步的调试（监视）了
#include<stdio.h>
int main()
{
	int i = 0;
	int arr[10] = { 0 };

	for (i = 0;i < 10;i++)
	{
		arr[i] = i;
	}

	//如果已经确定了这个程序前面的代码没有错误，是后面出现了问题，如果还是按照之前的方法F10一步步调试
	//那么要调试前面循环的10次，循环10次后才能调试到下面的代码----这样的效率太低了
	//如下，如果在这里设置断点，程序运行后会直接快速运行到断点所在的语句，后面就可以一步一步
	//调试断点下面的语句了
	for (i = 0;i < 10;i++)
	{
		printf("%d", arr[i]);
	}
	return 0;
}

//F10    逐过程，通常用来处理一个过程，一个过程可以是一次函数调用，或者是一条语句（不能进入函数内部）
//F11    逐语句，就是每次都执行一条语句，但是这个快捷键可以使我们的执行逻辑进入函数内部（这是最常用的）
//CTRL+F5 开始不调试，如果你想让程序直接运行起来而不调试就可以直接使用


//自动窗口---会自动加载在调试过程中上下文的变量的信息（但是会随着调试的进行，一些调试已经经过的变量就不自在了----还是不够方便）
//局部变量---会自动加载在调试过程中上下文的局部变量的信息

//用的最多的还是监视（虽然要自己输入信息，但是是想要监视什么就会一直保留信息（方便对比））

//（数组传参的时候传的是首元素的地址--所以调试的时候只能看到第一个元素的信息）
//要想看到传的所有信息怎么办————监视时输入（a，4）（括号不用输）--就能看到4个元素的信息

//调试--窗口--内存--地址（输入数组名--可得到数组的地址）---表示内存中的真实数据（为了让我们方便去看，显示的是16进制的（电脑存的是2进制））
// 最左边对应的是地址----最后是电脑主动分析的可能存放的信息（以文本形式，所以文本内容一本能看到，其他分析不了）
//在列输入（4）---表示一行有4个字节


//在代码互相调用的时候---要想知道--调用堆栈

//查看汇编信息
