//操作符详解
//操作符的分类
//1.算数操作符
//2.移位操作符
//3.位操作符
//4.赋值操作符
//5.单目操作符
//6.关系操作符
//7.逻辑操作符
//8.条件操作符
//9.逗号表达式
//10.下标引用，函数调用和结构成员


//1.算数操作符

//= - * /
//重点讲解‘/’--除号  
//整形的除法---1/2=0    浮点型的除法  ----1.0/2.0=0.5  至少有一个为浮点型
//‘%’取模操作符计算的是整除之后的余数      取模操作符‘%’两端必须是整数    负数的取模C语言深度解刨--蛋哥


//2.移位操作符
//'<<'左移操作符---移位操作符移动的是二进制位
//#include<stdio.h>
//int mian()
//{
//	int a = 7;
//	int b = a << 1;//左移--移动的是二进制位
//	//左移的计算规则--左边丢弃，右边补0
//
//	pritnf("a=%d", a);//a=7,不变
//	printf("b=%d", b);//b=14，得到的是a向左移动1位的结果
//
//	return 0;
//}

//#include<stdio.h>
//int main()
//{
//	int a = -7;
//	int b = a << 1;
//
//	printf("a=%d", a);//a=-7,
//	printf("b=%d", b);//b=-14，
//
//	return 0;
//}

//整数的左移有*2的效果
//左移右移操作符只针对整形，不能浮点型

//整数的二进制表示有3种
//原码 补码 反码
//正的整数原码，反码，补码是相同的
//负的整数的原码，反码，补码是要计算的
//	-7
//100000000000000000000000000111-原码
//111111111111111111111111111000-反码（符号位不变，其他位取反）
//111111111111111111111111111001-补码--（反码+1）


//右移操作符 >>
//算数移位---右边丢弃，左边补原符号位
//逻辑移位---右边丢弃，左边补0
//#include<stdio.h>
//int mian()
//{
//	int a = 7;
//	int b = a >> 1;
//
//	pritnf("a=%d", a);//7
//	printf("b=%d", b);//3-----这样测不出来是算术移位还是逻辑移位---用负数试试
//
//	return 0;
//}

//#include<stdio.h>
//int main()
//{
//	int a = -7;
//	int b = a >> 1;//移位操作数不能是负数，不能是浮点数
//	printf("a=%d", a);//-7
//	printf("b=%d", b);//-4
////说明VS编译器采用的是算数移位，采用什么方式取决于编译器
//	return 0;
//}


//3.位操作符

//&----按（2进制）位与
//！---按（2进制）位或
//^----按（2进制）位异或

//&----按（2进制）位与
//有0为0，全1为1
//#include<stdio.h>
//int main()
//{
//	int a = 3;
//	//00000000000000000000000000000011---3的补码
//	//10000000000000000000000000000101---‘-5’的原码
//	//11111111111111111111111111111010---‘-5’的反码
//	//11111111111111111111111111111011---‘-5’的补码
//	//00000000000000000000000000000011---3的补码
//	//00000000000000000000000000000011---&后的结果
//
//	//%d意味着打印一个有符号的整数
//	int b = -5;
//	int c = a & b;
//
//
//	printf("c=%d", c);//c=3
//
//
//	return 0;
//}



//！---按（2进制）位或
//有1则1，全0为0
//#include<stdio.h>
//int main()
//{
//	int a = 3;
//	int b = -5;
//	int c = a | b;
//	//	//00000000000000000000000000000011---3的补码
//	//	//10000000000000000000000000000101---‘-5’的原码
//	//	//11111111111111111111111111111010---‘-5’的反码
//	//	//11111111111111111111111111111011---‘-5’的补码
//	//	//00000000000000000000000000000011---3的补码
//	//	//11111111111111111111111111111011---|后的结果(补码）
//	//	//11111111111111111111111111111010
//	//	//10000000000000000000000000000101--原码---“-5”
//
//
//
//
//	printf("c=%d", c);
//
//	return 0;
//}


//^----按（2进制）位异或
//相同为0，相异为1
//#include<stdio.h>
//int main()
//{
//	int a = 3;
//	int b = -5;
//	int c = a ^ b;
//		//00000000000000000000000000000011---3的补码
//		//10000000000000000000000000000101---‘-5’的原码
//		//11111111111111111111111111111010---‘-5’的反码
//		//11111111111111111111111111111011---‘-5’的补码
//		//00000000000000000000000000000011---3的补码
//		//11111111111111111111111111111000---^后的结果(补码）
//		//11111111111111111111111111110111
//		//10000000000000000000000000001000--原码---“-8”
//	printf("c=%d", c);//-8
//
//	return 0;
//}

//异或操作符的运用
//不创建临时变量，交换两个数的值
//交换空瓶法不行，因为创建了临时变量
//a=a+b这个方法不行，因为会溢出
//那么尝试用异或来解决


#include<stdio.h>
int main()
{
	int a = 3;
	int b = -5;
	printf("交换前a=%d,b=%d\n", a,b);
	a = a ^ b;
	b = a ^ b;
	a = a ^ b;
	printf("交换后a=%d,b=%d\n", a, b);


	return 0;
}
