#pragma once

#include<stdio.h>
#include<string.h>

void menu();

void New(int num[],char name[],int math[],int C[]);

int Sort(int num[], char name[], int math[], int C[]);

void Retrieve(int num[], char name[], int math[], int C[]);




//设某班有n位同学，每位同学数据包含以下内容：学号（字符数组）、姓名（字符数组）、数学成绩（整型）、
// 程序设计基础成绩（整型）。设计一个简单的学生成绩管理系统，实现以下主要功能：新建数据档案、添加数据、
// 删除数据、对输入数据进行排序、查找。程序执行流程如下：
//（1）程序运行，利用printf函数显示主菜单，并提醒输入对应数字进行相关操作。显示主菜单如下：
//1.	新建数据
//2.	添加数据
//3.	删除数据
//4.	排序
//5.	查询
//6.	退出
//（2）若输入1，则进入新建数据界面。依据提醒依次输入学生人数、学生学号、姓名、数学成绩、程序设计基础成绩。
//      操作完成后，输出所有学生信息。
//（3）若输入2，进入数据添加界面。原有学生人数n加1，输入添加学生的数据。
//     添加操作完成后，输出所有学生信息。
//（4）若输入3，进入删除数据界面。输入要删除学生学号（或姓名），根据学号（姓名）查找该学生， 
//     若未找到，则输出“学号（姓名）不存在”；若找到则将后面学生信息前移（删除位置之后的所有学生均需
//     前移），覆盖删除数据，学生人数n减1。删除操作完成后，输出所有学生信息。
//（5）若输入4，进入排序界面。可设计按照学号或成绩进行排序。输出排序后的学生信息。
//（6）若输入5，进入查询界面。可设计按照学号或姓名进行信息查询。若查询的信息存在则输出该生信息，
//     若不存在则输出“学号（姓名）不存在”。
//（7）若输入6，则退出程序。