//函数的声明和定义
//#include<stdio.h>
//int main()
//{
//	int a = 0;
//	int b = 0;
//	scanf_s("%d %d", &a, &b);
//	int sum = Add(a, b);
//	printf("%d\n", sum);
//	return 0;
//}
////函数的定义
//int Add(int x, int y)
//{
//	return x + y;
//}
//报了一个警报--因为函数的第定义放在了主函数的后面


//函数的声明---可以让函数定义在主函数后面
//#include<stdio.h>
//int Add(int x, int y);//这就是函数的声明
////函数的声明仅仅告诉你有一个函数存在（函数叫什么，参数是什么，返回类型是什么），但是不决定真正的函数是否存在----即可能是一个假的声明
//// 函数的声明一般放在头文件中
////函数的声明一般出现在函数的使用之前，要满足先声明后定义
//int main()
//{
//	int a = 0;
//	int b = 0;
//	scanf_s("%d %d", &a, &b);
//	int sum = Add(a, b);
//	printf("%d\n", sum);
//	return 0;
//}
////函数的定义
//int Add(int x, int y)
//{
//	return x + y;
//}


//函数的声明一般放在头文件中

#include<stdio.h>
#include"Add.h"//-----函数的声明一般放在头文件中--这样加法的功能就可以实现了----程序运行结果没问题
//
// 包含头文件的基本意义是把头文件的内容拷贝过来--所以把函数的声明放到头文件中就相当于已经进行了函数的声明
// 头文件就是为了实现声明的效果
// 这是函数的定义和函数的声明分开的好处
// 定义和声明分开的另一个好处是：
// 
// 
//自己写的头文件写成“”
//跟库函数很相似--只用包含头文件就可以了

//函数的声明放到头文件中了
int main()
{
	int a = 0;
	int b = 0;
	scanf_s("%d %d", &a, &b);
	int sum = Add(a, b);
	printf("%d\n", sum);
	return 0;
}
//函数的定义--放到Add.c里面去
//把函数的定义和声明拆开


//在初学编程的时候，觉得把所有代码写到一个头文件里最方便
//但是在公司中不是这样的----100个人不能在同一个头文件中协作---每个人分工协作，划分模块
//比如再建一个减法函数，分别建.c.h----。。。。可实现加减乘除----计算器
#pragma comment(lib,"add.lib")//可以使用静态库//前提.c.h中有函数的定义和声明

