//递归
//什么是递归
//程序调用自身的编程技巧称为递归，是一种方法，它通常把一个复杂的问题转化为与原问题相似的规模较小的问题来求解，大大减小了代码量
// 核心思想为把大事化小
//

//接收一个整型值（无符号），按照顺序打印他的每一位
//#include<stdio.h>
//int main()
//{
//	unsigned int num = 0;
//	scanf_s("%u", num);//%u是打印无符号的整数，%d是打印有符号的整数
//	//要想得到1234中的4，则%10，剩下的就是4---1234/10就得到了123--用123%10就得到了3--123/10得到了12---12%10就i得到了2---12/10就得到了1
//	//可以看出这是一个循环
//	//但是这样打印的顺序就反了
//	//1.可以先把他存起来，再按照你想知道的打印
//	while (num)
//	{
//		printf("%d", num % 10);
//		num = num / 10;
//	}
//	return 0;
//
//}

//引出递归的实现
//条件是函数--函数的递归
//print(1234)
//print(123)4
//print(12)3 4
//print(1)2 3 4
//1 2 34 


void print(unsigned int n)
{
	if (n > 9)
	{
		print(n / 10);

	}
	printf("%d", n % 10);
}
#include<stdio.h>
int main()
{
	unsigned int num = 0;
	scanf_s("%u", num);
	print(num);//这个函数的作用是接受一个整型值（无符号），按照顺序打印他的每一位
	return 0;

}